{
  "content": [
    {
      "type": "grid",
      "layout": [
        6
      ],
      "children": [
        {
          "type": "column",
          "children": [
            {
              "type": "paragraph",
              "children": [
                {
                  "text": "The 1961 abduction of Barney and Betty Hill is arguably the most famous close encounter in American history; since the story of their abduction went public, it has been the subject of several books, documentaries, scholarly analyses, and fictionalized works. The events of the Hill case have become emblematic of the archetypal alien abduction scenario. In 2002, Betty Hill was the guest on the inaugural episode of "
                },
                {
                  "text": "The UFO Connection",
                  "italic": true
                },
                {
                  "text": ", a public-access television show in Sacramento, California. "
                },
                {
                  "text": "The UFO Connection ",
                  "italic": true
                },
                {
                  "text": "was hosted by fellow UFO enthusiast Cynthia Siegel, who is an active member in local UFO organizations. The hour-long interview offers auditory clues into the process of creating and shifting the identity of the alien abductee."
                }
              ]
            },
            {
              "type": "paragraph",
              "children": [
                {
                  "text": "\nThis project listens to the voices of Betty Hill and Cynthia Siegel to better understand the dialectic process of what Ian Hacking calls “making up people.” I pay particular attention to the way that rehearsed storytelling practices, discourses of evidence, humor, and temporalities of abduction appear in the interview. The creative strategies Hill employs are emblematic of a collective process of rehearsed storytelling that abductees engage in order to make sense of experiences that have cast them to the fringes of societal legitimacy."
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": ""
        }
      ]
    }
  ],
  "created_at": "2025-04-30T17:52:18.125Z",
  "created_by": "leobriggs",
  "title": "Listening to Betty Hill",
  "updated_at": "2025-05-05T15:57:27.401Z",
  "updated_by": "absempere",
  "autogenerate": {
    "enabled": false,
    "type": "home"
  }
}